УТ_для_edt/src/Documents/смартПредзаказПоставщику/смартПредзаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартПредзаказПоставщику</name>
  <comment>#1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов &quot;Предзаказ поставщику&quot;</comment>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.ЗаказНаСборку</basedOn>
  <registerRecords>AccumulationRegister.смартПредзаказыПоставщикам</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склады</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозГотовностиУПоставщика</name>
    <comment>#Б-3262 смарт: Лопато 14.05.2025 //Доработать отчет &quot;Остатки и доступность товаров&quot;. Добавить информацию о прогнозном сроке изготовления.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <comment>#4552 смарт: Тимофеева 01.10.2025 / Автозаказ. Формирование предзаказов по потребностям.</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышенныйТаможенныйСбор</name>
      <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/ОбеспечениеЗаказов/ОбеспечениеЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбеспечениеЗаказов</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаличиеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартПотребностьГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКЗаказуГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартНаличиеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьТолькоНаличиеПодЗаказ</name>
    <comment>Контролировать только наличие товара</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/смартПредзаказыПоставщикам/смартПредзаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартПредзаказыПоставщикам</name>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерПоДаннымПоставщикаУдалить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщикаУдалить</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредзаказПоставщику</name>
    <type>
      <types>DocumentRef.смартПредзаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартТипыНазначенийРазобранногоОборудования/смартТипыНазначенийРазобранногоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыНазначенийРазобранногоОборудования</name>
  <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
  <enumValues>
    <name>СнятаяЗапаснаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПолученныйУзел</name>
  </enumValues>
  <enumValues>
    <name>НаЗаменуСнятойЗапаснойЧасти</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартПредзаказПоставщику/Forms/ФормаПодбораПоЗаявкаНаРазборкуОборудования/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;
	КонецЕсли;
	
	Если Параметры.Свойство("Предзаказ") Тогда
		Предзаказ = Параметры.Предзаказ;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеДокумента") Тогда
		
		Для каждого стрДанныеДокумента Из Параметры.ДанныеДокумента Цикл
			
			НоваяСтрока = ПодобраноВПредзаказ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрДанныеДокумента);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьОстаткиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(СформироватьДанныеДляВозврата());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	ОбновитьОстаткиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ОбновитьОстаткиСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Предзаказ", Предзаказ);
	Запрос.УстановитьПараметр("ТЗ", ПодобраноВПредзаказ.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Назначение КАК Назначение,
	|	Т.Количество КАК Количество
	|ПОМЕСТИТЬ ВТУжеПодобрано
	|ИЗ
	|	&ТЗ КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Назначение КАК Назначение,
	|	Остатки.КЗаказуОстаток + Остатки.смартКЗаказуГарантийныеОстаток КАК КЗаказуОстаток
	|ПОМЕСТИТЬ ВТОстаткиДляЗаказа
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказов.Остатки КАК Остатки
	|ГДЕ
	|	Остатки.Назначение.Заказ ССЫЛКА Документ.смартЗаявкаНаРазборкуОборудования
	|	И НЕ Остатки.Назначение.Заказ = ЗНАЧЕНИЕ(Документ.смартЗаявкаНаРазборкуОборудования.ПустаяСсылка)
	|	И Остатки.Назначение.смартРазобранноеОборудованиеТипНазначения = ЗНАЧЕНИЕ(Перечисление.смартТипыНазначенийРазобранногоОборудования.НаЗаменуСнятойЗапаснойЧасти)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартПредзаказыПоставщикамОбороты.Номенклатура КАК Номенклатура,
	|	смартПредзаказыПоставщикамОбороты.Характеристика КАК Характеристика,
	|	смартПредзаказыПоставщикамОбороты.ПредзаказПоставщику КАК ПредзаказПоставщику,
	|	смартПредзаказыПоставщикамОбороты.Назначение КАК Назначение,
	|	смартПредзаказыПоставщикамОбороты.ЗаказаноПриход КАК КоличествоЗаказано
	|ПОМЕСТИТЬ ВТУжеЗаказано
	|ИЗ
	|	РегистрНакопления.смартПредзаказыПоставщикам.Обороты(
	|			,
	|			,
	|			,
	|			(Номенклатура, Характеристика, Назначение) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						Т.Назначение
	|					ИЗ
	|						ВТОстаткиДляЗаказа КАК Т)
	|				И НЕ ПредзаказПоставщику = &Предзаказ) КАК смартПредзаказыПоставщикамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Характеристика КАК Характеристика,
	|	Данные.Назначение КАК Назначение,
	|	СУММА(Данные.Количество) КАК Количество,
	|	Данные.Назначение.Заказ КАК ЗаявкаНаРазборкуОборудования
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТОстаткиДляЗаказа.Номенклатура КАК Номенклатура,
	|		ВТОстаткиДляЗаказа.Характеристика КАК Характеристика,
	|		ВТОстаткиДляЗаказа.Назначение КАК Назначение,
	|		ВТОстаткиДляЗаказа.КЗаказуОстаток КАК Количество
	|	ИЗ
	|		ВТОстаткиДляЗаказа КАК ВТОстаткиДляЗаказа
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТУжеЗаказано.Номенклатура,
	|		ВТУжеЗаказано.Характеристика,
	|		ВТУжеЗаказано.Назначение,
	|		-ВТУжеЗаказано.КоличествоЗаказано
	|	ИЗ
	|		ВТУжеЗаказано КАК ВТУжеЗаказано
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТУжеПодобрано.Номенклатура,
	|		ВТУжеПодобрано.Характеристика,
	|		ВТУжеПодобрано.Назначение,
	|		-ВТУжеПодобрано.Количество
	|	ИЗ
	|		ВТУжеПодобрано КАК ВТУжеПодобрано) КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Номенклатура,
	|	Данные.Характеристика,
	|	Данные.Назначение,
	|	Данные.Назначение.Заказ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Данные.Количество) > 0";
	
	ДанныеДляПодбора.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция СформироватьДанныеДляВозврата()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеДляПодбора.Выгрузить(Новый Структура("Заказать", Истина)));
	
КонецФункции

#КонецОбласти
